In [28]:
data = {
    "EmployeeID": [101, 102, 103, 104, 105],
    "Name": ["Alice", "Bob", "Charlie", "Diana", "Evan"],
    "Department": ["HR", "IT", "Finance", "IT", "Marketing"],
    "Age": [29, 35, 41, 28, 32],
    "Salary": [45000, 65000, 70000, 60000, 52000],
    "Experience_Years": [4, 10, 15, 3, 7]
}

In [29]:
import pandas as pd

In [30]:
df=pd.DataFrame(data)

In [31]:
df

   EmployeeID     Name Department  Age  Salary  Experience_Years
0         101    Alice         HR   29   45000                 4
1         102      Bob         IT   35   65000                10
2         103  Charlie    Finance   41   70000                15
3         104    Diana         IT   28   60000                 3
4         105     Evan  Marketing   32   52000                 7

In [32]:
df.columns

Index(['EmployeeID', 'Name', 'Department', 'Age', 'Salary',
       'Experience_Years'],
      dtype='object')

In [33]:
for col in df.columns:
    print(col)

EmployeeID
Name
Department
Age
Salary
Experience_Years

In [34]:
print("total salary: ",df.Salary.sum())

total salary:  292000

In [35]:
print("average salary:",df.Salary.sum()/len(df))

average salary: 58400.0

In [36]:
df.Department.mode()

0    IT
Name: Department, dtype: object

In [37]:
print("average salary:",df.Salary.mean())

average salary: 58400.0

In [38]:
print("middle salary:",df.Salary.median())

middle salary: 60000.0

In [39]:
sorted(df.Experience_Years)

[3, 4, 7, 10, 15]

In [40]:
df.Salary.std()

np.float64(10014.988766843426)

In [41]:
import numpy as np

In [42]:
data = {
    "EmployeeID": [101,102, 103, 104, 105],
    "Name": [np.nan, "Bob", "Charlie", "Diana", "Evan"],
    "Department": ["HR", "IT", "Finance", "IT", np.nan],
    "Age": [29, 35, 41, 28, 32],
    "Salary": [45000, 65000, 70000, np.nan, 52000],
    "Experience_Years": [4, 10, 15, 3, 7]
}

In [43]:
df=pd.DataFrame(data)

In [44]:
df

   EmployeeID     Name Department  Age   Salary  Experience_Years
0         101      NaN         HR   29  45000.0                 4
1         102      Bob         IT   35  65000.0                10
2         103  Charlie    Finance   41  70000.0                15
3         104    Diana         IT   28      NaN                 3
4         105     Evan        NaN   32  52000.0                 7

In [45]:
df.isnull().sum()

EmployeeID          0
Name                1
Department          1
Age                 0
Salary              1
Experience_Years    0
dtype: int64

In [46]:
df.isnull().sum().sum()

np.int64(3)

In [47]:
df.dropna()

   EmployeeID     Name Department  Age   Salary  Experience_Years
1         102      Bob         IT   35  65000.0                10
2         103  Charlie    Finance   41  70000.0                15

In [48]:
df.dropna(inplace=True)

In [49]:
df

   EmployeeID     Name Department  Age   Salary  Experience_Years
1         102      Bob         IT   35  65000.0                10
2         103  Charlie    Finance   41  70000.0                15